; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-4-5)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-1 - location
	p1-2 - location
	p2-0 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s1)
	(at driver3 s0)
	(at driver4 s2)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at package1 s2)
	(at package2 s1)
	(at package3 s0)
	(at package4 s1)
	(at package5 s0)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 99)
	(= (time-to-walk p0-1 s0) 99)
	(= (time-to-walk s1 p0-1) 94)
	(= (time-to-walk p0-1 s1) 94)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 84)
	(= (time-to-walk p1-2 s1) 84)
	(= (time-to-walk s2 p1-2) 1)
	(= (time-to-walk p1-2 s2) 1)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 52)
	(= (time-to-walk p2-0 s2) 52)
	(= (time-to-walk s0 p2-0) 19)
	(= (time-to-walk p2-0 s0) 19)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 100)
	(= (time-to-drive s2 s0) 100)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 39)
	(= (time-to-drive s0 s1) 39)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 40)
	(= (time-to-drive s2 s1) 40)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s0)
	(at driver3 s2)
	(at truck1 s1)
	(at truck3 s0)
	(at truck4 s0)
	(at package1 s0)
	(at package2 s0)
	(at package3 s1)
	(at package4 s2)
	(at package5 s0)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 1  (driven))) (* 3  (walked))))

)

; plan
1. (board-truck driver4 truck3 s2)
   deleted: (at driver4 s2) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 3 of 11
2. (walk driver2 s1 p0-1)
   deleted: (at driver2 s1)
   added: (at driver2 p0-1)
   changed: (walked) from 0 to 94
   goals met: 3 of 11
3. (walk driver2 p0-1 s0)
   deleted: (at driver2 p0-1)
   added: (at driver2 s0)
   changed: (walked) from 94 to 193
   goals met: 4 of 11
4. (walk driver3 s0 p2-0)
   deleted: (at driver3 s0)
   added: (at driver3 p2-0)
   changed: (walked) from 193 to 212
   goals met: 4 of 11
5. (walk driver3 p2-0 s2)
   deleted: (at driver3 p2-0)
   added: (at driver3 s2)
   changed: (walked) from 212 to 264
   goals met: 5 of 11
6. (load-truck package1 truck3 s2)
   deleted: (at package1 s2)
   added: (in package1 truck3)
   goals met: 5 of 11
7. (drive-truck truck3 s2 s0 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (driven) from 0 to 100
   goals met: 6 of 11
8. (unload-truck package1 truck3 s0)
   deleted: (in package1 truck3)
   added: (at package1 s0)
   goals met: 7 of 11
9. (drive-truck truck3 s0 s1 driver4)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (driven) from 100 to 139
   goals met: 6 of 11
10. (load-truck package2 truck3 s1)
   deleted: (at package2 s1)
   added: (in package2 truck3)
   goals met: 6 of 11
11. (load-truck package4 truck3 s1)
   deleted: (at package4 s1)
   added: (in package4 truck3)
   goals met: 6 of 11
12. (drive-truck truck3 s1 s2 driver4)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (driven) from 139 to 179
   goals met: 6 of 11
13. (unload-truck package4 truck3 s2)
   deleted: (in package4 truck3)
   added: (at package4 s2)
   goals met: 7 of 11
14. (drive-truck truck3 s2 s0 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (driven) from 179 to 279
   goals met: 8 of 11
15. (unload-truck package2 truck3 s0)
   deleted: (in package2 truck3)
   added: (at package2 s0)
   goals met: 9 of 11
16. (board-truck driver3 truck4 s2)
   deleted: (at driver3 s2) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 8 of 11
17. (drive-truck truck4 s2 s0 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   changed: (driven) from 279 to 379
   goals met: 9 of 11
18. (load-truck package3 truck4 s0)
   deleted: (at package3 s0)
   added: (in package3 truck4)
   goals met: 9 of 11
19. (drive-truck truck4 s0 s2 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s2)
   changed: (driven) from 379 to 479
   goals met: 8 of 11
20. (disembark-truck driver3 truck4 s2)
   deleted: (driving driver3 truck4)
   added: (at driver3 s2) (empty truck4)
   goals met: 9 of 11
21. (board-truck driver3 truck2 s2)
   deleted: (at driver3 s2) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 8 of 11
22. (unload-truck package3 truck4 s2)
   deleted: (in package3 truck4)
   added: (at package3 s2)
   goals met: 8 of 11
23. (drive-truck truck2 s2 s1 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (driven) from 479 to 519
   goals met: 8 of 11
24. (drive-truck truck3 s0 s2 driver4)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (driven) from 519 to 619
   goals met: 7 of 11
25. (drive-truck truck2 s1 s2 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (driven) from 619 to 659
   goals met: 7 of 11
26. (drive-truck truck3 s2 s1 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (driven) from 659 to 699
   goals met: 7 of 11
27. (load-truck package3 truck2 s2)
   deleted: (at package3 s2)
   added: (in package3 truck2)
   goals met: 7 of 11
28. (drive-truck truck2 s2 s1 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (driven) from 699 to 739
   goals met: 7 of 11
29. (unload-truck package3 truck2 s1)
   deleted: (in package3 truck2)
   added: (at package3 s1)
   goals met: 8 of 11
30. (walk driver2 s0 p2-0)
   deleted: (at driver2 s0)
   added: (at driver2 p2-0)
   changed: (walked) from 264 to 283
   goals met: 7 of 11
31. (drive-truck truck3 s1 s0 driver4)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (driven) from 739 to 778
   goals met: 8 of 11
32. (walk driver2 p2-0 s2)
   deleted: (at driver2 p2-0)
   added: (at driver2 s2)
   changed: (walked) from 283 to 335
   goals met: 8 of 11
33. (board-truck driver2 truck4 s2)
   deleted: (at driver2 s2) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 8 of 11
34. (drive-truck truck4 s2 s0 driver2)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   changed: (driven) from 778 to 878
   goals met: 9 of 11
35. (disembark-truck driver2 truck4 s0)
   deleted: (driving driver2 truck4)
   added: (at driver2 s0) (empty truck4)
   goals met: 10 of 11
36. (drive-truck truck2 s1 s2 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (driven) from 878 to 918
   goals met: 10 of 11
37. (disembark-truck driver3 truck2 s2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s2) (empty truck2)
   goals met: 11 of 11
